# Erase Method (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
ElectricalSystemSet..::..Erase Method
ElectricalSystemSet Class See Also
---
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
# Syntax
C#
---
```text
public virtual int Erase(
	ElectricalSystem item
)
```

Visual Basic
---
```text
Public Overridable Function Erase ( _
	item As ElectricalSystem _
) As Integer
```

Visual C++
---
```text
public:
virtual int Erase(
	ElectricalSystem^ item
)
```

# ### Parameters
item
    Type: Autodesk.Revit.DB.Electrical..::..ElectricalSystem
# See Also
ElectricalSystemSet Class
Autodesk.Revit.DB.Electrical Namespace